zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
#if (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED))
static inline void Adc_Sar_CheckAndCallEoctuNotification(const uint32 Instance);
#endif

#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
static inline void Adc_Sar_CheckAndCallEocNotification(uint32 Instance,
                                                       uint16 ChanIdx,
                                                       uint16 VectAdr,
                                                       uint32 EocFlag,
                                                       boolean * CeocfrFlag);
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
static inline uint32 Adc_Sar_CheckAndCallWorrNotification(uint32 Instance,
                                                          uint16 ChanIdx,
                                                          uint16 VectAdr);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
static inline void Adc_CheckAndCallAllChannelNotification(const uint32 Instance);
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE || ADC_SAR_IP_EXT_TRIGGER_AVAILABLE)
static inline void Adc_Sar_ConfigExternalTrigger(const uint32 Instance,
                                                 const Adc_Sar_Ip_ExtTriggerEdgeType TriggerEdge,
                                                 const uint32 TrgEdgeSetMask,
                                                 const uint32 TrgEdgeClrMask,
                                                 const uint32 TrigSrcMask);
#endif /* (ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE || ADC_SAR_IP_EXT_TRIGGER_AVAILABLE) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

static inline void Adc_Sar_SetNormalChain(const uint32 Instance,
                                          const uint32 * const Mask);
static inline void Adc_Sar_SetInjectedChain(const uint32 Instance,
                                            const uint32 * const Mask);

/* The function is used to reduce complexity for parent function */
static inline uint32 Adc_Sar_GetValueFromBool(const boolean bVal,
                                              const uint32 TrueVal,
                                              const uint32 FalseVal);

#if ADC_SAR_IP_CALIBRATION_AVAILABLE
static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkRestore(const uint32 u32Instance,
                                                                  volatile uint32 * MCRAddr,
                                                                  uint32 McrSavedValue);
static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkSelect(const uint32 u32Instance,
                                                                 volatile uint32 * MCRAddr,
                                                                 uint32* McrSavedValue);
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE)
#if defined(ADC_CAL2_ENX_MASK)
static inline void Adc_Sar_SetupCalibration(volatile uint32 * CALBISTREGAddr,
                                            volatile uint32 * CAL2Addr);
#else
static inline void Adc_Sar_SetupCalibration(volatile uint32 * CALBISTREGAddr);
#endif /* defined(ADC_CAL2_ENX_MASK) */
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE) */
static inline Adc_Sar_Ip_StatusType Adc_Sar_ComputeCapacitorCalibrationValue(uint32 GccCalibRaw,
                                                                             uint32 * GccCalibAdjusted);
static inline Adc_Sar_Ip_StatusType Adc_Sar_PerformGCRUpdate(volatile const uint32 * GCCAddr,
                                                             volatile uint32 * GCRAddr);
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckCapCalibrationStatus(volatile const uint32 *MSRAddr);
static inline Adc_Sar_Ip_StatusType Adc_Sar_PerformCapacitorCalibration(uint32 u32Instance);
#endif /* ADC_SAR_IP_CALIBRATION_AVAILABLE */
#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckTimeoutStatus(const uint32 ActualTimeout,
                                                               const uint32 ExpectTimeout);
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */


/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_Powerup
 * Description   : Turning on power to the analog portion of ADC
 *
 *END*************************************************************************/
static inline void Adc_Sar_Powerup(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        AdcBasePtr->MCR &= ~(ADC_MCR_PWDN(1u));
    }
}


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_Powerdown
 * Description   : Turning off power to the analog portion of ADC
 *
 *END*************************************************************************/
static inline void Adc_Sar_Powerdown(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        AdcBasePtr->MCR |= ADC_MCR_PWDN(1u);
    }
}


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_WriteThresholds
 * Description   : Write Watchdog low, high thresholds for a wdog register
 *
 *END*************************************************************************/
static inline void Adc_Sar_WriteThresholds(const uint32 Instance,
                                           const uint8 RegisterNumber,
                                           const uint16 HighThreshold,
                                           const uint16 LowThreshold)
{
#if ADC_SAR_IP_HAS_THRHLR_ARRAY
    ADC_Type * AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
    uint32 Value = ADC_THRHLR_THRH(HighThreshold) |
                   ADC_THRHLR_THRL(LowThreshold);
    THRHLR(AdcBasePtr, RegisterNumber) = Value;
#else /* ADC_SAR_IP_HAS_THRHLR_ARRAY == 0 */
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * ThrhlrAddr = NULL_PTR;
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        switch (RegisterNumber)
        {
            case 0u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR0);
                break;
            case 1u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR1);
                break;
            case 2u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR2);
                break;
            case 3u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR3);
                break;
            case 4u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR4);
                break;
            case 5u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR5);
                break;
    #if (ADC_SAR_IP_THRHLR_COUNT > 6U)
            case 6u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR6);
                break;
            case 7u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR7);
                break;
    #if (ADC_SAR_IP_THRHLR_COUNT > 8U)
            case 8u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR8);
                break;
            case 9u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR9);
                break;
            case 10u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR10);
                break;
            case 11u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR11);
                break;
    #if (ADC_SAR_IP_THRHLR_COUNT > 12U)
            case 12u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR12);
                break;
            case 13u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR13);
                break;
            case 14u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR14);
                break;
            case 15u:
                ThrhlrAddr = (volatile uint32 *)&(AdcBasePtr->THRHLR15);
                break;
    #endif /* ((ADC_SAR_IP_THRHLR_COUNT > 12U) || ...) */
    #endif /* ((ADC_SAR_IP_THRHLR_COUNT > 8U) || ...) */
    #endif /* ((ADC_SAR_IP_THRHLR_COUNT > 6U) || ...) */
            default:
                ; /* no-op */
                break;
        }
    }
    uint32 Value = ADC_THRHLR0_THRH(HighThreshold) |
                   ADC_THRHLR0_THRL(LowThreshold);
    if (ThrhlrAddr != NULL_PTR)
    {
        *ThrhlrAddr = Value;
    }
#endif /* !ADC_SAR_IP_HAS_THRHLR_ARRAY */
}


#if ADC_SAR_IP_CWSELR_AVAILABLE
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED )
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_WriteChannelMapping
 * Description   :
 *
 *END*************************************************************************/
static inline void Adc_Sar_WriteChannelMapping(const uint32 Instance,
                                               const uint32 RegisterNumber,
                                               const uint32 FieldPosition,
                                               const uint32 Value)
{
    uint32 CwselrVal;
    uint32 CwselrMask;
    uint32 CwselrShift;

    ADC_Type * const AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

