zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
    CwselrShift = FieldPosition * ADC_CWSELR_WSEL_CH1_SHIFT;
    CwselrMask = (uint32)ADC_CWSELR_WSEL_CH0_MASK << CwselrShift;
    CwselrVal  = CWSELR(AdcBasePtr, RegisterNumber) & (~CwselrMask);
    CwselrVal |= ADC_CWSELR_WSEL_CH0(Value) << CwselrShift;
    CWSELR(AdcBasePtr, RegisterNumber) = CwselrVal;
}
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

static inline void Adc_Sar_ResetWdogCWSELR(const uint32 Instance, const uint8 RegisterNumber)
{
    ADC_Type * const AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

    CWSELR(AdcBasePtr, RegisterNumber) = 0u;
}
#endif /* ADC_SAR_IP_CWSELR_AVAILABLE */

#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckTimeoutStatus(const uint32 ActualTimeout,
                                                               const uint32 ExpectTimeout)
{
    Adc_Sar_Ip_StatusType RelValue = ADC_SAR_IP_STATUS_SUCCESS;
    /* Check if the timeout is not expected */
    if (ActualTimeout >= ExpectTimeout)
    {
        RelValue = ADC_SAR_IP_STATUS_TIMEOUT;
    }

    /* Return the value of ADC SAR status */
    return RelValue;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */
#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_ConfigSelftestThreshold
 * Description   : Configure self-test threshold value
 *
 *END*************************************************************************/
static inline void Adc_Sar_ConfigSelftestThreshold(const uint32 Instance,
                                                   const Adc_Sar_Ip_SelfTestThresholdType * SelfTestThresholdConfig)
{

    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * STAWVBGAddr = NULL_PTR;
    volatile uint32 * STAWVDDIAddr = NULL_PTR;
    volatile uint32 * STAWVDDFAddr = NULL_PTR;
    volatile uint32 * STAWVRHLAddr = NULL_PTR;
    volatile uint32 * STAWOFSAddr = NULL_PTR;
    volatile uint32 * STAWCAPMAddr = NULL_PTR;
    volatile uint32 * STAWCAPIAddr = NULL_PTR;
    volatile uint32 * STAWCAPLAddr = NULL_PTR;

    AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

    STAWVBGAddr  = (volatile uint32 *)&(AdcBasePtr->STAWVBG);
    STAWVDDIAddr = (volatile uint32 *)&(AdcBasePtr->STAWVDDI);
    STAWVDDFAddr = (volatile uint32 *)&(AdcBasePtr->STAWVDDF);
    STAWVRHLAddr = (volatile uint32 *)&(AdcBasePtr->STAWVRHL);
    STAWOFSAddr  = (volatile uint32 *)&(AdcBasePtr->STAWOFS);
    STAWCAPMAddr = (volatile uint32 *)&(AdcBasePtr->STAWCAPM);
    STAWCAPIAddr = (volatile uint32 *)&(AdcBasePtr->STAWCAPI);
    STAWCAPLAddr = (volatile uint32 *)&(AdcBasePtr->STAWCAPL);

    /* Configure the self-test watchdog threshold for VBG supply algorithm step */
    *STAWVBGAddr = 0UL;
    *STAWVBGAddr |= SARADC_STAWVBG_THRHVBG(SelfTestThresholdConfig->AdcSTAWVBGHighVal) | SARADC_STAWVBG_THRLVBG(SelfTestThresholdConfig->AdcSTAWVBGLowVal);
    /* Configure the self-test watchdog threshold for VDDI supply algorithm step */
    *STAWVDDIAddr = 0UL;
    *STAWVDDIAddr |= SARADC_STAWVDDI_THRHVDDI(SelfTestThresholdConfig->AdcSTAWVDDIHighVal) | SARADC_STAWVDDI_THRLVDDI(SelfTestThresholdConfig->AdcSTAWVDDILowVal);
    /* Configure the self-test watchdog threshold for VDDF supply algorithm step */
    *STAWVDDFAddr = 0UL;
    *STAWVDDFAddr |= SARADC_STAWVDDF_THRHVDDF(SelfTestThresholdConfig->AdcSTAWVDDFHighVal) | SARADC_STAWVDDF_THRLVDDF(SelfTestThresholdConfig->AdcSTAWVDDFLowVal);
    /* Configure the self-test watchdog threshold for VREFH supply algorithm step */
    *STAWVRHLAddr = 0UL;
    *STAWVRHLAddr |= SARADC_STAWVRHL_VREFL(SelfTestThresholdConfig->AdcSTAWVRHLLowVal) | SARADC_STAWVRHL_VRCORXN(SelfTestThresholdConfig->AdcSTAWVRHLCorrVal) | SARADC_STAWVRHL_THRLVRHL(SelfTestThresholdConfig->AdcSTAWVRHLCompVal);
    /* Configure the self-test watchdog threshold for offset algorithm */
    *STAWOFSAddr = 0UL;
    *STAWOFSAddr |= SARADC_STAWOFS_THRHOFS(SelfTestThresholdConfig->AdcSTAWOFSHighVal) | SARADC_STAWOFS_THRLOFS(SelfTestThresholdConfig->AdcSTAWOFSLowVal);
    /* Configure the self-test watchdog threshold for MSB capacitor algorithm step*/
    *STAWCAPMAddr = 0UL;
    *STAWCAPMAddr |= SARADC_STAWCAPM_THRHCAPM(SelfTestThresholdConfig->AdcSTAWCAPMHighVal) | SARADC_STAWCAPM_THRLCAPM(SelfTestThresholdConfig->AdcSTAWCAPMLowVal);
    /* Configure the self-test watchdog threshold for ISB capacitor algorithm step*/
    *STAWCAPIAddr = 0UL;
    *STAWCAPIAddr |= SARADC_STAWCAPI_THRHCAPI(SelfTestThresholdConfig->AdcSTAWCAPIHighVal) | SARADC_STAWCAPI_THRLCAPI(SelfTestThresholdConfig->AdcSTAWCAPILowVal);
    /* Configure the self-test watchdog threshold for LSB capacitor algorithm step*/
    *STAWCAPLAddr = 0UL;
    *STAWCAPLAddr |= SARADC_STAWCAPL_THRHCAPL(SelfTestThresholdConfig->AdcSTAWCAPLHighVal) | SARADC_STAWCAPL_THRLCAPL(SelfTestThresholdConfig->AdcSTAWCAPLLowVal);
}
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_EnableSelftestThreshold
 * Description   : Enable self-test threshold
 *
 *END*************************************************************************/
static inline void Adc_Sar_EnableSelftestThreshold(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
    volatile uint32 * STCR1Addr = NULL_PTR;

    AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
    STCR1Addr = (volatile uint32 *)&(AdcBasePtr->STCR1);
    /* enable self-test watchdog thresholds for algorithms S, O and P when STC2[ALGO] is 3 */
    *STCR1Addr |= SARADC_STC1_AWDEVBG(0x1UL) | SARADC_STC1_AWDEVDD(0x1UL) | SARADC_STC1_AWDEVRHL(0x1UL) | SARADC_STC1_AWDEOFS(0x1UL) | SARADC_STC1_AWDECAP(0x1UL);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */
}

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_DisableSelftestThreshold
 * Description   : Disable self-test threshold
 *
 *END*************************************************************************/
static inline void Adc_Sar_DisableSelftestThreshold(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
    volatile uint32 * STCR1Addr = NULL_PTR;

