zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
    for (Index = 0U; Index < NumChannels; Index++)
    {
        ChnConfig = &(ChannelConfigsPtr[Index]);
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
        /* Each CWSELR register contains 8 watchdog selections according to 8 channels
           Each watchdog selection possibly needs maximum 4 bits for setting
           This is to calculate the CWSELR register index and position of channel on that register */
        VectAdr = (uint32)ChnConfig->ChanIndex / 8U;
        VectBit = (uint32)ChnConfig->ChanIndex % 8U;
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
        if (ADC_SAR_IP_INST_HAS_CWSELRn(Instance, VectAdr))
        {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#if (STD_ON == ADC_SAR_IP_CWSELR_AVAILABLE)
            Adc_Sar_WriteChannelMapping(Instance, VectAdr, VectBit, ChnConfig->WdgThreshRegIndex);
            /* Store threshold register index for configured channel */
            Adc_Sar_Ip_axAdcSarState[Instance].ChanWdgThresholdIndex[ChnConfig->ChanIndex] = ChnConfig->WdgThreshRegIndex;
#endif
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
        }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

        VectAdr = ADC_SAR_IP_CHAN_2_VECT((uint32)ChnConfig->ChanIndex);
        VectBit = ADC_SAR_IP_CHAN_2_BIT((uint32)ChnConfig->ChanIndex);
        /* Collect bit-mask for WDG, EOC, DMA and Presample */
#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
        CimrMask[VectAdr]  |= Adc_Sar_GetValueFromBool(ChnConfig->EndOfConvNotification, (1UL << VectBit), 0UL);
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
        CwenrMask[VectAdr] |= Adc_Sar_GetValueFromBool(ChnConfig->WdgNotificationEn, (1UL << VectBit), 0UL);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
        DmarMask[VectAdr]  |= Adc_Sar_GetValueFromBool(ChnConfig->EndOfConvDmaEnable, (1UL << VectBit), 0UL);
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
        PsrMask[VectAdr]   |= Adc_Sar_GetValueFromBool(ChnConfig->PresamplingEnable, (1UL << VectBit), 0UL);
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
    }

    /* Enable WDG, EOC, DMA and Presample */
    for (Index = 0U; Index < Adc_Sar_Ip_au8AdcGroupCount[Instance]; Index++)
    {
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
            CIMR(AdcBasePtr, Index) = CimrMask[Index];
            CWENR(AdcBasePtr, Index) = CwenrMask[Index];
            DMAR(AdcBasePtr, Index) = DmarMask[Index];
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
            PSR(AdcBasePtr, Index) = PsrMask[Index];
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
        }
    }
}

#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_CheckSelfTestProgress
 * Description   : Configures watchdog threshold with provided array of configuration
 *
 *END*************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckSelfTestProgress(const uint32 Instance)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    uint32 Reg = 0U;
    uint8 Index;
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile const uint32 * MSRAddr = NULL_PTR;
    volatile uint32 * STS1PAddr = NULL_PTR;
    volatile uint32 * STS1MAddr = NULL_PTR;
    const uint32 AlgoMask[3] = {SARADC_STS1_P_WDGEOA_S_MASK, SARADC_STS1_P_WDGEOA_O_MASK, SARADC_STS1_P_WDGEOA_C_MASK};

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
        STS1PAddr = (volatile uint32 *)&(AdcBasePtr->STS1_P);
        STS1MAddr = (volatile uint32 *)&(AdcBasePtr->STS1_M);
    }

     /*  Each for loop checks the conversion of all steps in self-test S algorithm
    *   ForLoop(0): wait for S algorithm to finish
    *   ForLoop(1): wait for O algorithm to finish
    *   ForLoop(2): wait for C algorithm to finish
    */
    for (Index = 0U; Index < 3U; Index++)
    {
        /* Wait until selftest has started*/
        Status = Adc_Sar_CheckFlagWithTimeout(MSRAddr, ADC_MSR_SELF_TEST_S_MASK, ADC_MSR_SELF_TEST_S_MASK);
        if (Status == ADC_SAR_IP_STATUS_SUCCESS)
        {
            Status = Adc_Sar_CheckFlagWithTimeout(STS1PAddr, AlgoMask[Index], AlgoMask[Index]);
            if (Status == ADC_SAR_IP_STATUS_TIMEOUT)
            {
                /* Break the loop if timeout occured in order to increase performance */
                break;
            }

            Status = Adc_Sar_CheckFlagWithTimeout(STS1MAddr, AlgoMask[Index], AlgoMask[Index]);
            if (Status == ADC_SAR_IP_STATUS_TIMEOUT)
            {
                /* Break the loop if timeout occured in order to increase performance */
                break;
            }
        }
        if (Status == ADC_SAR_IP_STATUS_TIMEOUT)
        {
            /* Break the loop if timeout occured in order to increase performance */
            break;
        }
    }

    if (Status != ADC_SAR_IP_STATUS_TIMEOUT)
    {
        Reg |= SARADC_STS1_P_ERRVBG_MASK | SARADC_STS1_P_ERRVDD_MASK | SARADC_STS1_P_ERRVRTST_MASK |
               SARADC_STS1_P_ERROFS_MASK | SARADC_STS1_P_ERRCAP_MASK;


        uint32 STS1PAddrTemp = *STS1PAddr;
        uint32 STS1MAddrTemp = *STS1MAddr;
        if (((STS1PAddrTemp & Reg) != 0UL) || ((STS1MAddrTemp & Reg) != 0UL))
        {
            Status = ADC_SAR_IP_STATUS_ERROR;
        }

        /* clear error flags */
        Reg = 0;
        Reg |= SARADC_STS1_P_ERRVBG(0x01U) | SARADC_STS1_P_ERRVDD(0x01U) | SARADC_STS1_P_ERRVRTST(0x01U) |
               SARADC_STS1_P_ERROFS(0x01U) | SARADC_STS1_P_ERRCAP(0x01U) | SARADC_STS1_P_OVERWR(0x01U) | SARADC_STS1_P_WDTERR(0x01U);
        *STS1PAddr = Reg;
        *STS1MAddr = Reg;
    }
    /* clear self test status flags in case of a timeout occurence */
    Reg = 0;
    Reg |= SARADC_STS1_P_WDGEOA_S(0x01U) | SARADC_STS1_P_WDGEOA_O(0x01U) | SARADC_STS1_P_WDGEOA_C(0x01U) |
           SARADC_STS1_P_STEOCSUP(0x01U) | SARADC_STS1_P_STEOCOFS(0x01U) | SARADC_STS1_P_STEOCCAP(0x01U);
    *STS1PAddr = Reg;
    *STS1MAddr = Reg;
    return Status;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_GetConvResults
 * Description   : Reads the conversion results to output arrays
 * Params:
 *  - Instance : the ADC Instance to read
 *  - ChainType : the conversion chain (Normal, Injected or CTU)
 *  - ResultsRaw : an uint16 array to write only conversion data
 *  - ResultsStruct : an Adc_Sar_Ip_ChanResultType array to write detailed information
                      about each conversion result
 *  - length : the maximum size of ResultsRaw and ResultsStruct
 *
 * ResultsRaw or ResultsStruct can be NULL, but not both, as the function will
 * have nowhere to write the results.
 *
 *END*************************************************************************/
static uint32 Adc_Sar_GetConvResults(const uint32 Instance,
                                     const Adc_Sar_Ip_ConvChainType ChainType,
                                     uint16 * const ResultsRaw,
                                     Adc_Sar_Ip_ChanResultType * const ResultsStruct,
                                     const uint32 Length)
{
    uint32 Index = 0u;
    boolean LengthExceeded = FALSE;
    uint32 VectAdr;
    uint32 VectBit;
    uint8 ChnIdx;
    uint32 Cdr;
    volatile uint32 * CEOCFRAddr = NULL_PTR;
    volatile uint32 * CEOCFBaseRAddr;
    volatile const uint32 * CdrBaseRAddr;
    const uint16 AdcChanCount[ADC_SAR_IP_INSTANCE_COUNT][ADC_SAR_IP_NUM_GROUP_CHAN] = ADC_SAR_IP_MAX_CHN_COUNT;
    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr     = Adc_Sar_Ip_apxAdcBase[Instance];
        CEOCFBaseRAddr = &(CEOCFR(AdcBasePtr, 0U));
        CdrBaseRAddr   = &(CDR(AdcBasePtr, 0U));
    }

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    /* ResultsRaw and ResultsStruct cannot be both NULL */
    DevAssert((boolean)((ResultsRaw != NULL_PTR) || (ResultsStruct != NULL_PTR)));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    /* Go through each channel group */
    for (VectAdr = 0u; VectAdr < Adc_Sar_Ip_au8AdcGroupCount[Instance]; VectAdr++)
    {
        CEOCFRAddr = &CEOCFBaseRAddr[VectAdr];
        /* go through each bit in the group, check if there is a completed conversion */
        for (VectBit = 0u; VectBit < AdcChanCount[Instance][VectAdr]; VectBit++)
        {
            ChnIdx = (uint8)((VectAdr * 32u) + VectBit);
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
            if ((0u == ChnIdx) && ((ADC_SAR_IP_CONV_CHAIN_INJECTED == ChainType) || (ADC_SAR_IP_CONV_CHAIN_CTU == ChainType)))
            {
                continue;
            }
#endif /* FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND */
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
            if (!(ADC_SAR_IP_INST_HAS_CDRn(Instance, ChnIdx)))
            {
                continue; /* skip if the CDR register is not available */
            }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
            Cdr = CdrBaseRAddr[ChnIdx];
            if ((ADC_CDR_RESULT((uint32)ChainType) | ADC_CDR_VALID_MASK) == (Cdr & (ADC_CDR_RESULT_MASK | ADC_CDR_VALID_MASK)))
            {
                /* if the result type matches the one request by ChainType
                   and the data is valid, write to the output array(s)
                */
                if (ResultsRaw != NULL_PTR)
                {
                    ResultsRaw[Index] = Adc_Sar_GetMaskedResult(Instance, Cdr);
                }
                if (ResultsStruct != NULL_PTR)
                {
                    ResultsStruct[Index].ConvData = Adc_Sar_GetMaskedResult(Instance, Cdr);
                    ResultsStruct[Index].AdcChnIdx = ChnIdx;
                    ResultsStruct[Index].ValidFlag = ((Cdr & ADC_CDR_VALID_MASK) != 0U) ? TRUE : FALSE;
                    ResultsStruct[Index].OverWrittenFlag = ((Cdr & ADC_CDR_OVERW_MASK) != 0U) ? TRUE : FALSE;
                }
                /* Increment the current Index and reset the CEOCFR flag */
                *CEOCFRAddr = ((uint32)1UL << VectBit); /* w1c bit */
                Index++;
                if (Index >= Length)
                {
                    /* We have filled the output buffer, exit the loop.
                     * Data may still exist in the result registers, which won't be reached.
                     */
                    LengthExceeded = TRUE;
                    break;
                }
            }
        }
        if (LengthExceeded)
        {
            break;
        }
    }
    return Index;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_ResetWdog
 * Description   : Reset and disable the Analog Watchdog feature
 *
 *END*************************************************************************/
static void Adc_Sar_ResetWdog(const uint32 Instance)
{
    uint8 Index;
    uint8 MaxThresholdRegs = 0U;

    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        MaxThresholdRegs = ADC_SAR_IP_THRHLR_COUNT;
    }

    for (Index = 0u; Index < Adc_Sar_Ip_au8AdcGroupCount[Instance]; Index++)
    {
        {
            CWENR(AdcBasePtr, Index) = 0u;
            AWORR(AdcBasePtr, Index) = 0xFFFFFFFFu; /* w1c bits */
        }

