zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
    }

    for (Index = 0u; Index < MaxThresholdRegs; Index++)
    {
        Adc_Sar_WriteThresholds(Instance, Index, 0xFFFFu, 0u);
    }

#if ADC_SAR_IP_CWSELR_AVAILABLE
    for (Index = 0u; Index < ADC_SAR_IP_CWSELR_COUNT; Index++)
    {
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
        if (!(ADC_SAR_IP_INST_HAS_CWSELRn(Instance, Index)))
        {
            continue; /* skip register if it's not available */
        }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
        Adc_Sar_ResetWdogCWSELR(Instance, Index);
    }
#endif /* ADC_SAR_IP_CWSELR_AVAILABLE */
}

#if ((STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) \
     || (STD_ON == ADC_SAR_IP_CALIBRATION_AVAILABLE) \
    )
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_CheckFlagWithTimeout
 * Description   : This function perform wait and check for a mask with timeout.
 *
 *END*************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckFlagWithTimeout(volatile const uint32 * registerAddress,
                                                                 uint32 registerMask,
                                                                 uint32 testValue)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;

    while ((((*registerAddress) & registerMask) != testValue)  && (ElapsedTicks < TimeoutTicks))
    {
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
    }
    if (ElapsedTicks >= TimeoutTicks)
    {
        /* Timeout occurred while waiting for condition to set */
        Status = ADC_SAR_IP_STATUS_TIMEOUT;
    }

    return Status;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) || */

#if ( \
     (STD_ON == ADC_SAR_IP_ECH_ENABLED) || (STD_ON == ADC_SAR_IP_JECH_ENABLED) || \
     ((ADC_SAR_IP_HAS_CTU == 1U) && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED)) \
    )
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_CheckAndCallNotification
 * Description   : Checks if the given callback is not NULL then calls it
 *
 *END*************************************************************************/
static inline void Adc_Sar_CheckAndCallNotification(void (*Callback)(void))
{
    if (Callback != NULL_PTR)
    {
        Callback();
    }
}
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) .. */

#if (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED))
static inline void Adc_Sar_CheckAndCallEoctuNotification(const uint32 Instance)
{
    volatile const uint32 * CIMRBaseAddr;
    volatile uint32 * CEOCFBaseRAddr;
    volatile uint32 * ISRAddr;
    uint32 Imr;  /* Interrupt mask */
    uint32 Cimr; /* Channel Interrupt Mask */
    uint32 Ceocfr; /* Channel Pending Flag*/
    uint32 ChannelValidMask;
    boolean ValidInterrupt = FALSE;
    uint32 GroupIdx;
    ADC_Type * AdcBasePtr;
    {
        AdcBasePtr     = Adc_Sar_Ip_apxAdcBase[Instance];
        CEOCFBaseRAddr = &(CEOCFR(AdcBasePtr, 0U));
        CIMRBaseAddr   = &(CIMR(AdcBasePtr,   0U));
        ISRAddr        = (volatile uint32 *)&(AdcBasePtr->ISR);
        Imr            = AdcBasePtr->IMR;
    }

    if ( ((*ISRAddr & ADC_ISR_EOCTU_MASK) != 0U) && ((Imr & ADC_IMR_MSKEOCTU_MASK) != 0U) )
    {
        for (GroupIdx = 0U; GroupIdx < Adc_Sar_Ip_au8AdcGroupCount[Instance]; GroupIdx++)
        {
            ChannelValidMask = Adc_Sar_Ip_au32AdcChanBitmap[Instance][GroupIdx];
            /* Read channels interrupt mask and status in this group */
            Cimr             = CIMRBaseAddr[GroupIdx] & ChannelValidMask;
            Ceocfr           = CEOCFBaseRAddr[GroupIdx] & ChannelValidMask;
            /* CPR_RTD_00644: Check if the interrupt is spurious or not (both enabled and flag bits are set) */
            if ((Ceocfr & Cimr) != 0U)
            {
                /* Clears flag by w1c */
                CEOCFBaseRAddr[GroupIdx] = Ceocfr;
                ValidInterrupt = TRUE;
                /* Continue to check and clear pending flags for the rest of channel groups.
                   Because the EOC events of channels might be consecutively issued very fast.
                   For instance:
                     - While ISR handler is processing EOC event of a channel
                     - other channels might complete their conversions and raise the interrupt requests.
                   Therefore, we should clear all the individual channel flags (CEOCFR) along with the CTU flag ISR[EOCTU].
                */
            }
        }

        if (ValidInterrupt)
        {
            /* CPR_RTD_00644 */
            *ISRAddr = ADC_ISR_EOCTU_MASK;
            Adc_Sar_CheckAndCallNotification(Adc_Sar_Ip_axAdcSarState[Instance].EndOfCtuConversionNotification);
        }
    }
}
#endif /* (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_CheckAndCallEocNotification
 * Description   : Checks if the given channel interrupt was triggered, clears
 *                 the interrupt, check if it is not spurious, checks that the
 *                 callback is not null.
 *
 *END*************************************************************************/
static inline void Adc_Sar_CheckAndCallEocNotification(uint32 Instance,
                                                       uint16 ChanIdx,
                                                       uint16 VectAdr,
                                                       uint32 EocFlag,
                                                       boolean * CeocfrFlag)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    const uint32 Mask = (uint32)1UL << ADC_SAR_IP_CHAN_2_BIT(ChanIdx);
    uint32 Ceocfr = 0U;
    uint32 Cimr   = 0U;
    volatile uint32 * CEOCFRAddr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        CEOCFRAddr = &(CEOCFR(AdcBasePtr, VectAdr));
        Cimr   = (CIMR(AdcBasePtr, VectAdr) & Mask);
    }

    Ceocfr = ((*CEOCFRAddr) & Mask);
    /* Check if the interrupt was not spurious */
    if ((Ceocfr != 0U) && (Cimr != 0U) && (EocFlag != 0U))
    {
        /* Clears flag by w1c */
        *CEOCFRAddr = Mask;
        *CeocfrFlag = TRUE;

        /* Check if the callback is not null */
        if (Adc_Sar_Ip_axAdcSarState[Instance].EndOfConvNotification != NULL_PTR)
        {
            Adc_Sar_Ip_axAdcSarState[Instance].EndOfConvNotification(ChanIdx);
        }
    }
}
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_CheckAndCallWorrNotification
 * Description   : Checks if the given channel interrupt was triggered, clears
 *                 the interrupt, check if it is not spurious, checks that the
 *                 callback is not null and return WTISR flag
 *                 in order to be cleared outside of this function when loop of all channels is completed.
 *
 *END*************************************************************************/
static inline uint32 Adc_Sar_CheckAndCallWorrNotification(uint32 Instance,
                                                          uint16 ChanIdx,
                                                          uint16 VectAdr)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    const uint32 Mask = (uint32)1UL << ADC_SAR_IP_CHAN_2_BIT(ChanIdx);
    uint32 Aworr = 0U;
    uint32 Cwenr = 0U;
    uint32 Wtisr = 0U;
    uint32 Wtimr = 0U;
    uint32 WdgFlags = 0U;
    /* Use 16-bit width instead of 32-bit to avoid CWE INTEGER_OVERFLOW when performing multiplication in macros ADC_SAR_IP_WDG_REG_MASK below */
    uint16 ThresholdIndex;
    volatile uint32 * AWORRAddr;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        AWORRAddr = &(AWORR(AdcBasePtr, VectAdr));
        Cwenr = (CWENR(AdcBasePtr, VectAdr) & Mask);
        Wtisr = AdcBasePtr->WTISR;
        Wtimr = AdcBasePtr->WTIMR;
    }
    Aworr = ((*AWORRAddr) & Mask);

    /* Check if wdg channel enabled associated to the wdg out of range flag */
    if ((Aworr != 0U) && (Cwenr != 0U))
    {
        /* Get the mapping threshold register index corresponding to the configured channel */
        ThresholdIndex = (uint16)(Adc_Sar_Ip_axAdcSarState[Instance].ChanWdgThresholdIndex[ChanIdx]);

        /* Check if the high/low flags were not set spuriously. */
        if ((Wtimr & (ADC_SAR_IP_WDG_REG_MASK_LOW(ThresholdIndex))) != 0u)
        {
            WdgFlags |= ((Wtisr & ADC_SAR_IP_WDG_REG_MASK_LOW(ThresholdIndex)) != 0u) ? ADC_SAR_IP_WDG_LOW_FLAG : 0u;
        }
        if ((Wtimr & (ADC_SAR_IP_WDG_REG_MASK_HIGH(ThresholdIndex))) != 0u)
        {
            WdgFlags |= ((Wtisr & ADC_SAR_IP_WDG_REG_MASK_HIGH(ThresholdIndex)) != 0u) ? ADC_SAR_IP_WDG_HIGH_FLAG : 0u;
        }
        if (WdgFlags != 0u)
        {
            /* Only clear relevant flags if interrupt is not spurious (i.e: satisfy combination of AWORR-CWENR and WTISR-WTIMR) */
            *AWORRAddr = Mask;
            /* Multiple ADC channels can use same THRHLRx so return the associated WTISR flag value of that threshold
                which will be used for clearing all WTISR flags outside of this function, when completing the loop for ADC channels */
            WdgFlags = (uint32)(WdgFlags << (ThresholdIndex << 1U));
            /* Check if the callback is not null */
            if (Adc_Sar_Ip_axAdcSarState[Instance].WdgOutOfRangeNotification != NULL_PTR)
            {
                Adc_Sar_Ip_axAdcSarState[Instance].WdgOutOfRangeNotification(ChanIdx, WdgFlags);
            }
        }
    }

    return WdgFlags;
}
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
/*LOCAL FUNCTION*********************************************************************
 *
 * Function Name : Adc_CheckAndCallAllChannelNotification
 * Description   : Check for all watchdog interrupts and for all individual channel interrupts
 * if it was detected. And then call the appropriate notification
 *
 *END*********************************************************************************/
static inline void Adc_CheckAndCallAllChannelNotification(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint16 VectAdr;
    uint16 PhyChan;
    uint16 ChanCnt;
    const uint16 AdcChanCount[ADC_SAR_IP_INSTANCE_COUNT][ADC_SAR_IP_NUM_GROUP_CHAN] = ADC_SAR_IP_MAX_CHN_COUNT;
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    uint32 WtisrMask = 0U;
    volatile uint32 * WTISRAddr = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
    volatile const uint32 * IMRAddr = NULL_PTR;
    volatile uint32 * ISRAddr = NULL_PTR;
    uint32 EocFlag = 0U;
    boolean CeocfrFlag = FALSE;
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
        IMRAddr = (volatile uint32 *)&(AdcBasePtr->IMR);
        ISRAddr = (volatile uint32 *)&(AdcBasePtr->ISR);
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
        WTISRAddr = (volatile uint32 *)&(AdcBasePtr->WTISR);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
    }
#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
    /* EocFlag = 0 if all EOC flags are spurious interrupts */
    /* Avoid Compiler Warning about accessing two volatile variables simultaneously */
    EocFlag  = (*IMRAddr);
    EocFlag &= (*ISRAddr);
    EocFlag &= (ADC_ISR_EOC_MASK | ADC_ISR_JEOC_MASK);

