zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
    /* Clear EOC Flag */
    if (EocFlag != 0)
    {
        *ISRAddr = EocFlag;
    }
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

    for (VectAdr = 0U; VectAdr < Adc_Sar_Ip_au8AdcGroupCount[Instance]; VectAdr++)
    {
        for (ChanCnt = 0U; ChanCnt < AdcChanCount[Instance][VectAdr]; ChanCnt++)
        {
            PhyChan = (ChanCnt + (uint16)(ADC_SAR_IP_HW_REG_SIZE * VectAdr));

#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
            /* Check end of conversion interrupt */
            Adc_Sar_CheckAndCallEocNotification(Instance, PhyChan, VectAdr, EocFlag, &CeocfrFlag);
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
            /* Check watchdog out of range interrupt */
            WtisrMask |= Adc_Sar_CheckAndCallWorrNotification(Instance, PhyChan, VectAdr);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
        }
    }

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    if (WtisrMask != 0U)
    {
        *WTISRAddr = WtisrMask;
    }
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
}
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE || ADC_SAR_IP_EXT_TRIGGER_AVAILABLE)
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_ConfigExternalTrigger
* Description   : This function configures the external trigger.
*
* END**************************************************************************/
static inline void Adc_Sar_ConfigExternalTrigger(const uint32 Instance,
                                                 const Adc_Sar_Ip_ExtTriggerEdgeType TriggerEdge,
                                                 const uint32 TrgEdgeSetMask,
                                                 const uint32 TrgEdgeClrMask,
                                                 const uint32 TrigSrcMask)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * MCRAddr = NULL_PTR;

#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if (FALSE == Adc_Sar_Ip_axAdcSarState[Instance].CalibrationOnGoing)
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    {
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        }
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_21();

        switch (TriggerEdge)
        {
            case ADC_SAR_IP_EXT_TRIG_EDGE_FALLING:
                *MCRAddr &= ~TrgEdgeSetMask;  /* set to falling edge 0 */
                *MCRAddr |= TrigSrcMask;    /* enable external trigger */
                break;
            case ADC_SAR_IP_EXT_TRIG_EDGE_RISING:
                /* enable external trigger and set to rising edge EDGE = 1 */
                *MCRAddr |= (TrgEdgeSetMask | TrigSrcMask);
                break;
            case ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED:
                /* disable external trigger and reset edge field */
                *MCRAddr &= ~(TrgEdgeClrMask | TrigSrcMask);
                break;
            default:
                ; /* no-op */
                break;
        }
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_21();
}
#endif /* (ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE || ADC_SAR_IP_EXT_TRIGGER_AVAILABLE) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_Ip_IRQHandler
 * Description   : Handles Adc Sar interrupts
 *
 * @implements     Adc_Sar_Ip_IRQHandler_Activity
 *END*************************************************************************/
void Adc_Sar_Ip_IRQHandler(const uint32 Instance)
{
#if ((ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) || \
     (STD_ON == ADC_SAR_IP_ECH_ENABLED) || \
     (STD_ON == ADC_SAR_IP_JECH_ENABLED) || \
     (STD_ON == ADC_SAR_IP_WDG_ENABLED) )

    ADC_Type * AdcBasePtr = NULL_PTR;
#if ((ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) || \
     (STD_ON == ADC_SAR_IP_ECH_ENABLED) || \
     (STD_ON == ADC_SAR_IP_JECH_ENABLED))
    volatile uint32 * ISRAddr = NULL_PTR;
    uint32 Imr = 0u;
#endif /* (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) || ... */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    volatile uint32 * WTISRAddr = NULL_PTR;
    uint32 Wtimr = 0u;
    uint32 EnabledWdgThresholdFlags = 0u;
    uint8 GroupIdx = 0u;
    uint32 Aworr = 0u;
    uint32 Cwenr = 0u;
    uint32 EnabledWdgChannelFlags = 0u;
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#if ((ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) || \
     (STD_ON == ADC_SAR_IP_ECH_ENABLED) || \
     (STD_ON == ADC_SAR_IP_JECH_ENABLED))
        ISRAddr = (volatile uint32 *)&(AdcBasePtr->ISR);
        Imr = AdcBasePtr->IMR;
#endif /* (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)) || ... */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
        WTISRAddr = (volatile uint32 *)&(AdcBasePtr->WTISR);
        Wtimr = AdcBasePtr->WTIMR;
#endif
    }

    /* CPR_RTD_00011 */
    if (Adc_Sar_Ip_axAdcSarState[Instance].InitStatus)
    {
        /* Check which interrupt was triggered and not spurious, clear it and call the associated callback */
#if (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED))
        Adc_Sar_CheckAndCallEoctuNotification(Instance);
#endif /* (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */
#if (STD_ON == ADC_SAR_IP_ECH_ENABLED)
        if ((((*ISRAddr) & ADC_ISR_ECH_MASK) != 0U) && ((Imr & ADC_IMR_MSKECH_MASK) != 0U))
        {
            /* CPR_RTD_00644 */
            *ISRAddr = ADC_ISR_ECH_MASK;
            Adc_Sar_CheckAndCallNotification(Adc_Sar_Ip_axAdcSarState[Instance].EndOfNormalChainNotification);
        }
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) */
#if (STD_ON == ADC_SAR_IP_JECH_ENABLED)
        if ((((*ISRAddr) & ADC_ISR_JECH_MASK) != 0U) && ((Imr & ADC_IMR_MSKJECH_MASK)!= 0U))
        {
            /* CPR_RTD_00644 */
            *ISRAddr = ADC_ISR_JECH_MASK;
            Adc_Sar_CheckAndCallNotification(Adc_Sar_Ip_axAdcSarState[Instance].EndOfInjectedChainNotification);
        }
#endif /* (STD_ON == ADC_SAR_IP_JECH_ENABLED) */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
        Adc_CheckAndCallAllChannelNotification(Instance);
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */
    }
    else
    {
    /* CPR_RTD_00012 */
#if (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED))
        if ( ((*ISRAddr & ADC_ISR_EOCTU_MASK) != 0U) && ((Imr & ADC_IMR_MSKEOCTU_MASK) != 0U) )
        {
            /* Clear EOCTU interrupt flag */
            *ISRAddr = ADC_ISR_EOCTU_MASK;
        }
#endif /* (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */
#if (STD_ON == ADC_SAR_IP_ECH_ENABLED)
        if ((((*ISRAddr) & ADC_ISR_ECH_MASK) != 0U) && ((Imr & ADC_IMR_MSKECH_MASK) != 0U))
        {
            /* Clear ECH interrupt flag */
            *ISRAddr = ADC_ISR_ECH_MASK;
        }
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) */
#if (STD_ON == ADC_SAR_IP_JECH_ENABLED)
        if ((((*ISRAddr) & ADC_ISR_JECH_MASK) != 0U) && ((Imr & ADC_IMR_MSKJECH_MASK)!= 0U))
        {
            /* Clear JECH interrupt flag */
            *ISRAddr = ADC_ISR_JECH_MASK;
        }
#endif /* (STD_ON == ADC_SAR_IP_JECH_ENABLED) */
#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
        /* Clear EOC or JEOC interrupt flag */
        if ((*ISRAddr & ADC_ISR_EOC_MASK) && (Imr & ADC_IMR_MSKEOC_MASK))
        {
            *ISRAddr = ADC_ISR_EOC_MASK;
        }
        if ((*ISRAddr & ADC_ISR_JEOC_MASK) && (Imr & ADC_IMR_MSKJEOC_MASK))
        {
            *ISRAddr = ADC_ISR_JEOC_MASK;
        }
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
        /* Clear WTISR flags for enabled WDG threshold interrupts */
        EnabledWdgThresholdFlags = *WTISRAddr & Wtimr;

