zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
        if (EnabledWdgThresholdFlags != 0U)
        {
            *WTISRAddr = EnabledWdgThresholdFlags;
        }
        for (GroupIdx = 0U; GroupIdx < Adc_Sar_Ip_au8AdcGroupCount[Instance]; GroupIdx++)
        {
            {
                Aworr = AWORR(AdcBasePtr, GroupIdx);
                Cwenr = CWENR(AdcBasePtr, GroupIdx);
                EnabledWdgChannelFlags = Aworr & Cwenr;
                if (EnabledWdgChannelFlags != 0U)
                {
                    AWORR(AdcBasePtr, GroupIdx) = EnabledWdgChannelFlags;
                }
            }
        }
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
    }
#else
    (void) Instance;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_SetNormalChain
 * Description   : This function configures the ADC Normal Chain.
 *
 *END**************************************************************************/
static inline void Adc_Sar_SetNormalChain(const uint32 Instance,
                                          const uint32 * const Mask)
{
    uint8 Index;

    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        for (Index = 0U; Index < Adc_Sar_Ip_au8AdcGroupCount[Instance]; Index++)
        {
            NCMR(AdcBasePtr, Index) = Mask[Index];
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_SetInjectedChain
 * Description   : This function configures the ADC Injected Chain.
 *
 *END**************************************************************************/
static inline void Adc_Sar_SetInjectedChain(const uint32 Instance,
                                            const uint32 * const Mask)
{
    uint8 Index;

    ADC_Type * AdcBasePtr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        for (Index = 0U; Index < Adc_Sar_Ip_au8AdcGroupCount[Instance]; Index++)
        {
            JCMR(AdcBasePtr, Index) = Mask[Index];
        }
    }
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
    JCMR(AdcBasePtr, 0) |= ADC_JCMR0_CH0_MASK;
#endif /* FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND */
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_GetValueFromBool
 * Description   : The function is used to reduce complexity for parent function
 *
 *END**************************************************************************/
static inline uint32 Adc_Sar_GetValueFromBool(const boolean bVal,
                                              const uint32 TrueVal,
                                              const uint32 FalseVal)
{
    return ((TRUE == bVal) ? TrueVal : FalseVal);
}
#if ADC_SAR_IP_CALIBRATION_AVAILABLE
/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_CalibrationClkSelect
 * Description   : This function configures ADC clock for calibration.
 *
 *END**************************************************************************/

static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkSelect(const uint32 u32Instance, volatile uint32 * MCRAddr, uint32 * McrSavedValue)
{
    uint32 Mcr;
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;

    /* Set CLKSEL to CalibrationClkSelect value */
    Status = Adc_Sar_Ip_Powerdown(u32Instance);
    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
        *McrSavedValue = *MCRAddr;
        Mcr = *MCRAddr;
#if ADC_SAR_IP_HAS_ADCLKSEL
        Mcr &= ~(ADC_MCR_ADCLKSEL_MASK);
        Mcr |= Adc_Sar_GetADCLKSELValue(Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationClkSelect);
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
#if ADC_SAR_IP_HAS_ADCLKDIV
        Mcr |= ADC_MCR_ADCLKDIV(1u);
#endif /* ADC_SAR_IP_HAS_ADCLKDIV */
        /* Disable AutoClockOff */
        Mcr &= ~(ADC_MCR_ACKO_MASK);
        *MCRAddr = Mcr;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

        Status = Adc_Sar_Ip_Powerup(u32Instance);

    }
    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_CalibrationClkRestore
 * Description   : This function restore ADC clock after calibration.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkRestore(const uint32 u32Instance, volatile uint32 * MCRAddr, uint32 McrSavedValue)
{
    uint32 Mcr;
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;

#if ADC_SAR_IP_HAS_ADCLKSEL
        /* Restore state of ADCLKSEL  */
    uint32 AdcClkSel = McrSavedValue & ADC_MCR_ADCLKSEL_MASK;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

    /* Restore state of ADCKO */
    uint32 AdcAutoClkOff = McrSavedValue & ADC_MSR_ACKO_MASK;

    /* Restore the state of ADCLKSEL */
    Status = Adc_Sar_Ip_Powerdown(u32Instance);

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
    Mcr = *MCRAddr;
#if ADC_SAR_IP_HAS_ADCLKSEL
    Mcr &= ~(ADC_MCR_ADCLKSEL_MASK);
    Mcr |= AdcClkSel;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
#if ADC_SAR_IP_HAS_ADCLKDIV
    Mcr &= ~(ADC_MCR_ADCLKDIV_MASK);
#endif /* ADC_SAR_IP_HAS_ADCLKDIV */
    Mcr |= AdcAutoClkOff;
    *MCRAddr = Mcr;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        Status = Adc_Sar_Ip_Powerup(u32Instance);
    }

#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing = FALSE;
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_SetupCalibration
 * Description   : This function setup calibration parameters.
 *
 *END**************************************************************************/
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE)
#if defined(ADC_CAL2_ENX_MASK)
static inline void Adc_Sar_SetupCalibration(volatile uint32 * CALBISTREGAddr, volatile uint32 * CAL2Addr)
#else
static inline void Adc_Sar_SetupCalibration(volatile uint32 * CALBISTREGAddr)
#endif /* defined(ADC_CAL2_ENX_MASK) */
{
    uint32 Calbistreg;
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_36();
    Calbistreg = *CALBISTREGAddr;
    /* clear the bits and set to calibration values */
    Calbistreg &= ~(ADC_SAR_IP_CALBISTREG_CST_LONG_MASK | ADC_SAR_IP_CALBISTREG_NR_SMPL_MASK | ADC_SAR_IP_CALBISTREG_AVG_EN_MASK | ADC_SAR_IP_CALBISTREG_TEST_EN_MASK | ADC_SAR_IP_CALBISTREG_TEST_CAP_EN_MASK);
    Calbistreg |= ADC_SAR_IP_CALBISTREG_NR_SMPL(0x03u) | ADC_SAR_IP_CALBISTREG_AVG_EN(1U);
    *CALBISTREGAddr = Calbistreg;
    /* Start calibration */
    *CALBISTREGAddr |= ADC_SAR_IP_CALBISTREG_TEST_EN(1U);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_36();
}
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE) */

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_ComputeCapacitorCalibrationValue
 * Description   : This function perfrom computation and adjustment of capacitor calibration values.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_ComputeCapacitorCalibrationValue(uint32 GccCalibRaw, uint32 * GccCalibAdjusted)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    sint32 GccCalibExtendSign = 0;
    uint32 divisor = 0;
    uint32 integerPart = 0;
    uint32 fractionalPart = 0;
    uint32 result = 0;

    sint32 TempGccCalibRawSigned = (sint32)GccCalibRaw; /* Use intermediate variable in order to avoid Misra 10.8 */

    uint32 TempGccCalibRawUnsigned = (uint32)TempGccCalibRawSigned << 15; /* Cast to unsigned in order to avoid Misra 10.1 */
    TempGccCalibRawSigned = (sint32)TempGccCalibRawUnsigned;

    TempGccCalibRawUnsigned = (uint32)TempGccCalibRawSigned >> 15;

    /* Sign extend from 17 to 32 bits */
    GccCalibExtendSign = (sint32)TempGccCalibRawUnsigned;

    /* Use intermediate variable in order to avoid Misra 10.8 */
    sint32 DivisorSigned = 65536 - GccCalibExtendSign;
    divisor = (uint32)DivisorSigned;
    /* Check for valid divisor to prevent division by zero */
    if (divisor <= 0U)
    {
        *GccCalibAdjusted =  0xFFFFFFFFU; /* Default to max value in case of invalid divisor */
        Status = ADC_SAR_IP_STATUS_ERROR;
    }
    else
    {
        result = (uint32)((uint64)(65536ULL * 65536ULL) / (uint32)divisor);

        integerPart = (uint32)(result >> 16U);
        fractionalPart = (uint32)(result & 0xFFFFU);

