zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
        *GccCalibAdjusted = (integerPart << 16U) | fractionalPart;
    }
    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_PerformGCRUpdate
 * Description   : This function perfrom update to the GCR_P/M register with the new calibration value.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_PerformGCRUpdate(volatile const uint32 * GCCAddr, volatile uint32 * GCRAddr)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    uint32 GccCalibRaw =  0u;
    uint32 GccCalibAdjusted =  0u;

     /* wait for the GCC_P[VALID] to assert*/
    Status = Adc_Sar_CheckFlagWithTimeout(GCCAddr, SARADC_GCC_P_VALID_MASK, SARADC_GCC_P_VALID_MASK);
    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        /* compute and save GCC P calibration adjusted value */
        GccCalibRaw = (uint32)((*GCCAddr) & SARADC_GCC_P_GAIN_CAL_MASK);
        Status = Adc_Sar_ComputeCapacitorCalibrationValue(GccCalibRaw, &GccCalibAdjusted);

        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
            *GCRAddr =  SARADC_GCR_P_GCALR(GccCalibAdjusted);
        }
    }

    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_CheckCapCalibrationStatus
 * Description   : This function check the final status flags for capacitor calibration.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckCapCalibrationStatus(volatile const uint32 *MSRAddr)

{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;

    /* wait and check the MS[CAP_DONE] flag */
    Status = Adc_Sar_CheckFlagWithTimeout(MSRAddr, ADC_MSR_CAP_DONE_MASK, ADC_MSR_CAP_DONE_MASK);

    /* Check the MS[CALFAIL] flag for calibration failure */
    uint32 MSRAddrTemp = *MSRAddr;
    if ((ADC_SAR_IP_STATUS_SUCCESS == Status) && ((MSRAddrTemp & ADC_MSR_CALFAIL_MASK) != 0U))
    {
        /* If the calibration failed, return error */
        Status = ADC_SAR_IP_STATUS_ERROR;
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }

    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_PerformCapacitorCalibration
 * Description   : This function perfrom the capacitor calibration algorithm.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_PerformCapacitorCalibration(uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    Adc_Sar_Ip_StatusType CalStatus = ADC_SAR_IP_STATUS_SUCCESS;
    volatile const uint32 * MSRAddr = NULL_PTR;
    volatile const uint32 * GCCPAddr = NULL_PTR;
    volatile uint32 * GCRPAddr = NULL_PTR;
    volatile const uint32 * GCCMAddr = NULL_PTR;
    volatile uint32 * GCRMAddr  = NULL_PTR;
    volatile uint32 * CALBISTREGAddr = NULL_PTR;

    AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
    MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
    GCCPAddr = (volatile const uint32 *)&(AdcBasePtr->GCC_P);
    GCRPAddr = (volatile uint32 *)&(AdcBasePtr->GCR_P);
    GCCMAddr = (volatile const uint32 *)&(AdcBasePtr->GCC_M);
    GCRMAddr = (volatile uint32 *)&(AdcBasePtr->GCR_M);
    CALBISTREGAddr = (volatile uint32 *)&(AdcBasePtr->CALBISTREG);

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_36();
    /* Start capacitor calibration */
    *CALBISTREGAddr |= ADC_SAR_IP_CALBISTREG_TEST_CAP_EN(1U);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_36();

    CalStatus = Adc_Sar_PerformGCRUpdate(GCCPAddr, GCRPAddr);

    if (ADC_SAR_IP_STATUS_SUCCESS == CalStatus)
    {
        CalStatus =  Adc_Sar_PerformGCRUpdate(GCCMAddr, GCRMAddr);

        if (ADC_SAR_IP_STATUS_SUCCESS == CalStatus)
        {
             /* set the GCR_X[VALID] bit */
            *GCRPAddr |= SARADC_GCR_P_VALID(0x01U);
            *GCRMAddr |= SARADC_GCR_P_VALID(0x01U);

            CalStatus = Adc_Sar_CheckCapCalibrationStatus(MSRAddr);
        }
        else
        {
            ; /* Empty else branch to avoid MISRA */
        }
    }
    else
    {
        /* If the calibration failed, return error */
        CalStatus = ADC_SAR_IP_STATUS_ERROR;
    }

    return CalStatus;
}

#endif /* ADC_SAR_IP_CALIBRATION_AVAILABLE */


/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Init
* Description   : This function initializes the ADC_SAR module by configuring all
* available features.
*
* @implements      Adc_Sar_Ip_Init_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Init(const uint32 u32Instance,
                                      const Adc_Sar_Ip_ConfigType * const pConfig)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    uint8 Index = 0u;
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
    volatile uint32 * MCRAddr = NULL_PTR;
    volatile uint32 * PDEDRAddr = NULL_PTR;
    volatile uint32 * DMAEAddr = NULL_PTR;
#ifdef ADC_DSDR_DSD
#if ADC_SAR_IP_DECODE_DELAY_AVAILABLE
    volatile uint32 * DSDRAddr = NULL_PTR;
#endif /* ADC_SAR_IP_DECODE_DELAY_AVAILABLE */
#endif /* ADC_DSDR_DSD */
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
    volatile uint32 * PSCRAddr = NULL_PTR;
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */

    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(pConfig != NULL_PTR));
#if ADC_SAR_IP_HAS_CTU
#if (ADC_SAR_IP_HAS_CTU_TRIGGER_MODE == 0u)
    /* test that the feature is enabled only on platforms that have it */
    DevAssert(pConfig->CtuMode != ADC_SAR_IP_CTU_MODE_TRIGGER);
#endif /* ADC_SAR_IP_HAS_CTU */
#endif /* (ADC_SAR_IP_HAS_CTU_TRIGGER_MODE == 0u) */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        PDEDRAddr = (volatile uint32 *)&(AdcBasePtr->PDEDR);
        DMAEAddr = (volatile uint32 *)&(AdcBasePtr->DMAE);
#ifdef ADC_DSDR_DSD
#if ADC_SAR_IP_DECODE_DELAY_AVAILABLE
        DSDRAddr = (volatile uint32 *)&(AdcBasePtr->DSDR);
#endif /* ADC_SAR_IP_DECODE_DELAY_AVAILABLE */
#endif /* ADC_DSDR_DSD */
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
        PSCRAddr = (volatile uint32 *)&(AdcBasePtr->PSCR);
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
    }

