zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
    return Status;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Deinit
* Description   : This function writes all the internal ADC registers with
*  their Reference Manual reset values.
*
* @implements      Adc_Sar_Ip_DeInit_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Deinit(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint32 Index;
    Adc_Sar_Ip_ConfigType DefaultConfig;
    Adc_Sar_Ip_StatusType Status;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    DefaultConfig.ConvMode = ADC_SAR_IP_CONV_MODE_ONESHOT;
    DefaultConfig.ClkSelect = ADC_SAR_IP_CLK_FULL_BUS;
    DefaultConfig.CalibrationClkSelect = ADC_SAR_IP_CLK_HALF_BUS;
#if ADC_SAR_IP_HIGH_SPEED_ENABLE_AVAILABLE
    DefaultConfig.HighSpeedConvEn = FALSE;
#endif /* ADC_SAR_IP_HIGH_SPEED_ENABLE_AVAILABLE */
#if ADC_SAR_IP_HAS_CTU
    DefaultConfig.CtuMode = ADC_SAR_IP_CTU_MODE_DISABLED;
#endif /* ADC_SAR_IP_HAS_CTU */
#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE
    DefaultConfig.InjectedEdge = ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED;
#endif /* ADC_SAR_IP_INJ_EXT_TRIGGER_AVAILABLE */
#if ADC_SAR_IP_EXT_TRIGGER_AVAILABLE
    DefaultConfig.ExtTrigger = ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED;
    DefaultConfig.NormalExtTrgEn = FALSE;
#if ADC_SAR_IP_AUX_EXT_TRIGGER_AVAILABLE
    DefaultConfig.NormalAuxExtTrgEn = FALSE;
#endif /* ADC_SAR_IP_AUX_EXT_TRIGGER_AVAILABLE */
#endif /* ADC_SAR_IP_EXT_TRIGGER_AVAILABLE */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */
#if (ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE || ADC_SAR_IP_PRESAMPLING_AVAILABLE)
    for (Index = 0u; Index < Adc_Sar_Ip_au8AdcGroupCount[u32Instance]; Index++)
    {
#if ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE
    {
        DefaultConfig.SampleTimeArr[Index] = ADC_SAR_IP_DEF_SAMPLE_TIME;
    }
#endif /* ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE */
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
#if (ADC_PSCR_PREVAL0_WIDTH > 1u)
        DefaultConfig.PresamplingSourceArr[Index] = ADC_SAR_IP_PRESAMPLE_DVDD;
#else
        DefaultConfig.PresamplingSourceArr[Index] = ADC_SAR_IP_PRESAMPLE_VREFL;
#endif /* (ADC_PSCR_PREVAL0_WIDTH > 1u) */
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
    }
#endif /* (ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE || ADC_SAR_IP_PRESAMPLING_AVAILABLE) */
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
    DefaultConfig.BypassSampling = FALSE;
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
    DefaultConfig.AutoClockOff = FALSE;
    DefaultConfig.OverwriteEnable = FALSE;
    DefaultConfig.DataAlign = ADC_SAR_IP_DATA_ALIGNED_RIGHT;
#if ADC_SAR_IP_DECODE_DELAY_AVAILABLE
    DefaultConfig.DecodeDelay = 0u;
#endif /* ADC_SAR_IP_DECODE_DELAY_AVAILABLE */
    DefaultConfig.PowerDownDelay = 0u;
#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
    DefaultConfig.SelfTestThresholdConfig = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */
#if ADC_SAR_IP_CLOCK_DIVIDER_AVAILABLE
    DefaultConfig.ClkDivEnable = FALSE;
#endif /* ADC_SAR_IP_CLOCK_DIVIDER_AVAILABLE */
#if ADC_SAR_IP_AVERAGING_AVAILABLE
    DefaultConfig.AvgEn = FALSE;
    DefaultConfig.AvgSel = ADC_SAR_IP_AVG_4_CONV;
#endif /* ADC_SAR_IP_AVERAGING_AVAILABLE */
    DefaultConfig.UsrOffset = 0u;
    DefaultConfig.UsrGain = 0u;
    DefaultConfig.DmaEnable = FALSE;
    DefaultConfig.DmaClearSource = ADC_SAR_IP_DMA_REQ_CLEAR_ON_ACK;
    DefaultConfig.NumChannels = 0u;
    DefaultConfig.ChannelConfigsPtr = NULL_PTR;
#if (STD_ON == ADC_SAR_IP_ECH_ENABLED)
    DefaultConfig.EndOfNormalChainNotification = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) */
#if (STD_ON == ADC_SAR_IP_JECH_ENABLED)
    DefaultConfig.EndOfInjectedChainNotification = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_JECH_ENABLED) */
#if ADC_SAR_IP_HAS_CTU
#if (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)
    DefaultConfig.EndOfCtuConversionNotification = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) */
#endif /* ADC_SAR_IP_HAS_CTU */

#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
    DefaultConfig.EndOfConvNotification = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    DefaultConfig.NumWdgThresholds = 0u;
    DefaultConfig.WdgThresholds = NULL_PTR;
    DefaultConfig.WdgOutOfRangeNotification = NULL_PTR;
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
    Status = Adc_Sar_Ip_Init(u32Instance, &DefaultConfig);
    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            for (Index = 0u; Index < Adc_Sar_Ip_au8AdcGroupCount[u32Instance]; Index++)
            {
                CIMR(AdcBasePtr, Index) = 0u;
                CEOCFR(AdcBasePtr, Index) = 0xFFFFFFFFu; /* w1c bits */
                DMAR(AdcBasePtr, Index) = 0u;
#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
                PSR(AdcBasePtr, Index) = 0u;
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */
            }

            /* Deinit watchdog interrupts */
            Adc_Sar_ResetWdog(u32Instance);
            AdcBasePtr->WTIMR = 0u;
        }
        /* Deinit channel configuration */

        Adc_Sar_Ip_ClearStatusFlags(u32Instance, ADC_SAR_IP_NOTIF_FLAG_ALL);
        /* Mark that the driver was deinitialized */
        Adc_Sar_Ip_axAdcSarState[u32Instance].InitStatus = FALSE;

        Status = Adc_Sar_Ip_Powerdown(u32Instance);

    }

    return Status;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_ChainConfig
* Description   : This function configures the ADC Normal and Injected Chains
*  with the options provided in the structure.
*
* @implements      Adc_Sar_Ip_ChainConfig_Activity
* END**************************************************************************/
void Adc_Sar_Ip_ChainConfig(const uint32 u32Instance,
                            const Adc_Sar_Ip_ChansIdxMaskType * const pChansIdxMask,
                            const Adc_Sar_Ip_ConvChainType pChainType)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(pChansIdxMask != NULL_PTR));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    uint8 i;

    /* Enabling unavailable channels is forbidden */
    for (i = 0U; i < ADC_SAR_IP_NUM_GROUP_CHAN; i++)
    {
        DevAssert((boolean)((pChansIdxMask->ChanMaskArr[i] & (~Adc_Sar_Ip_au32AdcChanBitmap[u32Instance][i])) == 0u));
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    switch (pChainType)
    {
        case ADC_SAR_IP_CONV_CHAIN_NORMAL:
            Adc_Sar_SetNormalChain(u32Instance, pChansIdxMask->ChanMaskArr);
            break;
        case ADC_SAR_IP_CONV_CHAIN_INJECTED:
            Adc_Sar_SetInjectedChain(u32Instance, pChansIdxMask->ChanMaskArr);
            break;
        default:
            ; /* no-op */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            break;
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_EnableChannel
* Description   : This function enables a channel in a conversion chain (
*  ADC_SAR_IP_CONV_CHAIN_NORMAL or ADC_SAR_IP_CONV_CHAIN_INJECTED).
*
* @implements      Adc_Sar_Ip_EnableChannel_Activity
* END**************************************************************************/
void Adc_Sar_Ip_EnableChannel(const uint32 u32Instance,
                              const Adc_Sar_Ip_ConvChainType pChainType,
                              const uint32 u32ChnIdx)
{
    uint32 VectAdr;
    uint32 VectBit;
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * NCMRAddr = NULL_PTR;
    volatile uint32 * JCMRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
    DevAssert((boolean)(!((0U == u32ChnIdx) && ((ADC_SAR_IP_CONV_CHAIN_INJECTED == pChainType) || (ADC_SAR_IP_CONV_CHAIN_CTU == pChainType)))));
#endif
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        NCMRAddr = &(NCMR(AdcBasePtr, VectAdr));
        JCMRAddr = &(JCMR(AdcBasePtr, VectAdr));
    }

    switch (pChainType)
    {
        case ADC_SAR_IP_CONV_CHAIN_NORMAL:
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_23();
            *NCMRAddr |= (1UL << VectBit);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_23();
            break;
        case ADC_SAR_IP_CONV_CHAIN_INJECTED:
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_26();
            *JCMRAddr |= (1UL << VectBit);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_26();
            break;
        default:
            ; /* no-op */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            break;
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisableChannel
* Description   : This function disables a channel from a conversion chain (ADC_SAR_IP_CONV_CHAIN_NORMAL
*  or ADC_SAR_IP_CONV_CHAIN_INJECTED).
*
* @implements      Adc_Sar_Ip_DisableChannel_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisableChannel(const uint32 u32Instance,
                               const Adc_Sar_Ip_ConvChainType pChainType,
                               const uint32 u32ChnIdx)
{
    uint32 VectAdr;
    uint32 VectBit;
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * NCMRAddr = NULL_PTR;
    volatile uint32 * JCMRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
    DevAssert((boolean)((0U == u32ChnIdx) && (ADC_SAR_IP_CONV_CHAIN_INJECTED == pChainType)));
#endif
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        NCMRAddr = &(NCMR(AdcBasePtr, VectAdr));
        JCMRAddr = &(JCMR(AdcBasePtr, VectAdr));
    }

    switch (pChainType)
    {
        case ADC_SAR_IP_CONV_CHAIN_NORMAL:
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_24();
            *NCMRAddr &= ~(1UL << VectBit);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_24();
            break;
        case ADC_SAR_IP_CONV_CHAIN_INJECTED:
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_27();
            *JCMRAddr &= ~(1UL << VectBit);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_27();
            break;
        default:
            ; /* no-op */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            break;
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_StartConversion
* Description   : This function starts a conversion chain (ADC_SAR_IP_CONV_CHAIN_NORMAL
*  or ADC_SAR_IP_CONV_CHAIN_INJECTED).
*
* @implements      Adc_Sar_Ip_StartConversion_Activity
* END**************************************************************************/
void Adc_Sar_Ip_StartConversion(const uint32 u32Instance,
                                const Adc_Sar_Ip_ConvChainType pChainType)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * MCRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if (FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    {
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        }

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_10();
        switch (pChainType)
        {
            case ADC_SAR_IP_CONV_CHAIN_NORMAL:
                *MCRAddr |= ADC_MCR_NSTART(1U);
                break;
            case ADC_SAR_IP_CONV_CHAIN_INJECTED:
                *MCRAddr |= ADC_MCR_JSTART(1U);
                break;
            default:
                ; /* no-op */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
                DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
                break;
        }
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_10();
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetStatusFlags
* Description   : This function returns the status flags of the ADC.
*
* @implements      Adc_Sar_Ip_GetStatusFlags_Activity
* END**************************************************************************/
uint32 Adc_Sar_Ip_GetStatusFlags(const uint32 u32Instance)
{
    uint32 Flags = 0U;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

