zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                /* Self-test will only run with CPU mode so clear CTU enable */
#if defined(ADC_MCR_CTUEN_MASK)
                *MCRAddr &= ~(ADC_MCR_CTUEN_MASK);
#endif /* ADC_MCR_CTUEN_MASK */

                /* 3. Program MCR[MODE] = 1 to select Scan mode.*/
                *MCRAddr |= ADC_MCR_MODE(0x1UL);
                /* 4. Configure MC Register for selftest */
                *MCRAddr &=~(ADC_MCR_AVGEN_MASK | ADC_MCR_AVGS_MASK | ADC_MCR_CTYPE_MASK | ADC_MCR_EDGE_MASK | ADC_MCR_TRGEN_MASK);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
                /* 5.  Select the self-testing algorithm in STCR2[ALG] */
                *STCR2Addr |= ADC_STCR2_ALG(0x3UL);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

                Adc_Sar_EnableSelftestThreshold(u32Instance);
                /* 6. Power up the ADC instance */
                Status = Adc_Sar_Ip_Powerup(u32Instance);
                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                {
                /* 7. Start the normal conversion by setting MCR[NSTART]. */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                *MCRAddr |= ADC_MCR_NSTART(0x1UL);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

                /*  Check that all algorithms have executed at least once. */
                Status = Adc_Sar_CheckSelfTestProgress(u32Instance);

                /* Stop the conversion */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                *MCRAddr &= ~(ADC_MCR_NSTART(0x1UL));
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                {
                    /* Read ADC status */
                    MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                    /* Wait for ADC changes to the expected Idle mode, The bitfield MSR[ADCSTATUS] should be checked to Idle state when MCR[NSTART] is written to 0 */
                    TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
                    ElapsedTicks = 0U;
                    while ((MsrStatus != ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE)) && (ElapsedTicks < TimeoutTicks))
                    {
                        MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                    }
                }

                Adc_Sar_DisableSelftestThreshold(u32Instance);

                /* Disable Self-test */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
                *STCR2Addr &= ~(ADC_STCR2_EN(0x1UL));
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();
                }
#if ADC_SAR_IP_SELFTEST_FULL_CLK
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                /* Enter into power-down Mode */
                Status = Adc_Sar_Ip_Powerdown(u32Instance);
#if ADC_SAR_IP_HAS_ADCLKSEL
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                /* Restore the state of ADCLKSEL */
                *MCRAddr &= ~(ADC_MCR_ADCLKSEL_MASK);
                *MCRAddr &= ~(ADC_MCR_ADCLKDIV_MASK);
                *MCRAddr |= AdcClkSel;
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                {
                    /* Exit into power-down Mode */
                    Status = Adc_Sar_Ip_Powerup(u32Instance);
                    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
                    {
                        Status = Adc_Sar_CheckTimeoutStatus(ElapsedTicks, TimeoutTicks);
                    }
#if ADC_SAR_IP_SELFTEST_FULL_CLK
                }
            }
        }
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    }
    else
    {
        Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
    }
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvDataToArray
* Description   : This function reads the conversion result values for a conversion chain
*  (ADC_SAR_IP_CONV_CHAIN_NORMAL, ADC_SAR_IP_CONV_CHAIN_INJECTED or ADC_SAR_IP_CONV_CHAIN_CTU).
*
* @implements      Adc_Sar_Ip_GetConvDataToArray_Activity
* END**************************************************************************/
uint32 Adc_Sar_Ip_GetConvDataToArray(const uint32 u32Instance,
                                     const Adc_Sar_Ip_ConvChainType pChainType,
                                     const uint32 u32Length,
                                     uint16 * const pResults)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    return Adc_Sar_GetConvResults(u32Instance, pChainType, pResults, NULL_PTR, u32Length);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvResultsToArray
* Description   : This function gets the conversion results for the selected
*  Conversion Chain. It follows the same algorithm as Adc_Sar_Ip_GetConvDataToArray,
*  but will copy some extra information to the output.
*
* @implements      Adc_Sar_Ip_GetConvResultsToArray_Activity
* END**************************************************************************/
uint32 Adc_Sar_Ip_GetConvResultsToArray(const uint32 u32Instance,
                                        const Adc_Sar_Ip_ConvChainType pChainType,
                                        const uint32 u32Length,
                                        Adc_Sar_Ip_ChanResultType* const pResults)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    return Adc_Sar_GetConvResults(u32Instance, pChainType, NULL_PTR, pResults, u32Length);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvData
* Description   : This function returns the result of the conversion for
* a single channel
*
* @implements      Adc_Sar_Ip_GetConvData_Activity
* END**************************************************************************/
uint16 Adc_Sar_Ip_GetConvData(const uint32 u32Instance,
                              const uint32 u32ChnIdx)
{
    uint16 Result = 0U;
    uint32 VectAdr;
    uint32 VectBit;
    uint32 Cdr;
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        Cdr = CDR(AdcBasePtr, u32ChnIdx);
        /* check if the conversion data is valid */
        if (((Cdr & ADC_CDR_VALID_MASK) != 0U))
        {
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
            if (!(((ADC_CDR_RESULT((uint32)ADC_SAR_IP_CONV_CHAIN_INJECTED) == (Cdr & (ADC_CDR_RESULT_MASK))) \
               || (ADC_CDR_RESULT((uint32)ADC_SAR_IP_CONV_CHAIN_CTU) == (Cdr & (ADC_CDR_RESULT_MASK)))) \
               && (0u == u32ChnIdx) \
                 ) \
               )
#endif
            {
                /* the data is correct, store the result in and clear the flag */
                Result = Adc_Sar_GetMaskedResult(u32Instance, Cdr);
                CEOCFR(AdcBasePtr, VectAdr) = ((uint32)1UL << VectBit); /* w1c bit */
            }
        }
    }

    return Result;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvResult
* Description   : This function returns the result and the status of
* the conversion for a single channel
*
* @implements      Adc_Sar_Ip_GetConvResult_Activity
* END**************************************************************************/
void Adc_Sar_Ip_GetConvResult(const uint32 u32Instance,
                              const uint32 u32ChnIdx,
                              const Adc_Sar_Ip_ConvChainType pChainType,
                              Adc_Sar_Ip_ChanResultType * const pResult)
{
    uint32 VectAdr;
    uint32 VectBit;
    uint32 Cdr;
    volatile uint32 * CEOCFRAddr = NULL_PTR;
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
    DevAssert((boolean)(pResult != NULL_PTR));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    pResult->ConvData = 0u;
    pResult->AdcChnIdx = (uint8)u32ChnIdx;
    pResult->ValidFlag = FALSE;
    pResult->OverWrittenFlag = FALSE;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        Cdr = CDR(AdcBasePtr, u32ChnIdx);
        CEOCFRAddr = &(CEOCFR(AdcBasePtr, VectAdr));
    }

    /* check if the result type matches the one request by pChainType */
    if (ADC_CDR_RESULT((uint32)pChainType) == (Cdr & ADC_CDR_RESULT_MASK))
    {
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
        if (!((0U == u32ChnIdx) && ((ADC_SAR_IP_CONV_CHAIN_INJECTED == pChainType) || (ADC_SAR_IP_CONV_CHAIN_CTU == pChainType))))
#endif /* FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND */
        {
            pResult->ValidFlag = ((Cdr & ADC_CDR_VALID_MASK) != 0U) ? TRUE : FALSE;
            pResult->OverWrittenFlag = (1U == ((Cdr & ADC_CDR_OVERW_MASK) >> ADC_CDR_OVERW_SHIFT));
            pResult->ConvData = Adc_Sar_GetMaskedResult(u32Instance, Cdr);
        }
    }

    *CEOCFRAddr = ((uint32)1UL << VectBit); /* w1c bit */
}

#if ADC_SAR_IP_CALIBRATION_AVAILABLE
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DoCalibration
* Description   : This functions executes a calibration sequence. It is recommended
*  to run this sequence before using the ADC converter. The maximum clock frequency
*  for the calibration is 40 MHz, this function sets the ADCLKSEL bit resulting in
*  a maximum input clock frequency of 80 MHz.
*
* @implements      Adc_Sar_Ip_DoCalibration_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_DoCalibration(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    Adc_Sar_Ip_StatusType CalStatus = ADC_SAR_IP_STATUS_SUCCESS;

    static uint32 McrSavedValue = 0u;
#if ADC_SAR_IP_CALIBRATION_USES_MCR
    uint32 Mcr;
    volatile const uint32 * MSRAddr = NULL_PTR;
#endif /* ADC_SAR_IP_CALIBRATION_USES_MCR */
    volatile uint32 * MCRAddr = NULL_PTR;
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE)
    volatile uint32 * CALBISTREGAddr = NULL_PTR;
    volatile const uint32 * MSRAddr = NULL_PTR;
#if defined(ADC_CAL2_ENX_MASK)
    volatile uint32 * CAL2Addr = NULL_PTR;
#endif /* defined(ADC_CAL2_ENX_MASK) */
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE) */


#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#if ADC_SAR_IP_CALIBRATION_USES_MCR
        MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#endif /* ADC_SAR_IP_CALIBRATION_USES_MCR*/
#if !ADC_SAR_IP_CALIBRATION_USES_MCR
        CALBISTREGAddr = (volatile uint32 *)&(AdcBasePtr->CALBISTREG);
#if defined(ADC_CAL2_ENX_MASK)
        CAL2Addr = (volatile uint32 *)&(AdcBasePtr->CAL2);
#endif /* defined(ADC_CAL2_ENX_MASK) */
#endif /* !ADC_SAR_IP_CALIBRATION_USES_MCR */
    }

