zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE)
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                if (Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing == FALSE)
                {
                    Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing = TRUE;
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
                    Status = Adc_Sar_CalibrationClkSelect(u32Instance, MCRAddr, &McrSavedValue);
                    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                    {
                #if defined(ADC_CAL2_ENX_MASK)
                        Adc_Sar_SetupCalibration(CALBISTREGAddr, CAL2Addr);
                #else
                        Adc_Sar_SetupCalibration(CALBISTREGAddr);
                #endif /* defined(ADC_CAL2_ENX_MASK) */
                    }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                    Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
                }
                else
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
                {
                    /* Wait for MS[OFS_DONE] to assert */
                    CalStatus = Adc_Sar_CheckFlagWithTimeout(MSRAddr, ADC_MSR_CALIBRTD_MASK, ADC_MSR_CALIBRTD_MASK);
                    if (ADC_SAR_IP_STATUS_SUCCESS == CalStatus)
                    {
                        /* wait for CALBIST[OFS_REQ] to clear */
                        CalStatus = Adc_Sar_CheckFlagWithTimeout(CALBISTREGAddr, ADC_SAR_IP_CALBISTREG_TEST_EN_MASK, 0U);
                        uint32 TempMSRAddr = *MSRAddr;
                        if ((ADC_SAR_IP_STATUS_SUCCESS == CalStatus) && ((TempMSRAddr & ADC_MSR_CALFAIL_MASK) != 0U))
                        {
                            /* If the calibration failed, return error */
                            CalStatus = ADC_SAR_IP_STATUS_ERROR;
                        }
                        else
                        {
                            ; /* Empty else branch to avoid MISRA */
                        }
                    }
                    /* wait for capacitor calibration to finish*/
                    if (ADC_SAR_IP_STATUS_SUCCESS == CalStatus)
                    {
                        CalStatus = Adc_Sar_PerformCapacitorCalibration(u32Instance);
                    }
                    else
                    {
                        ; /* Empty else branch to avoid MISRA */
                    }
                    Status = Adc_Sar_CalibrationClkRestore(u32Instance, MCRAddr, McrSavedValue);
                }
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || ADC_SAR_IP_APPLICATION_EXTENSION_AVAILABLE) */
            {
#if ADC_SAR_IP_CALIBRATION_USES_MCR
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                if (FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
                {
                    Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing = TRUE;
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
                    Status = Adc_Sar_CalibrationClkSelect(u32Instance, MCRAddr, &McrSavedValue);

                    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                    {
                        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
                        /* Clear the bits and set to calibration values */
                        Mcr = AdcBasePtr->MCR;
                        Mcr &= ~(ADC_MCR_TSAMP_MASK | ADC_MCR_NRSMPL_MASK | ADC_MCR_AVGEN_MASK);
                        Mcr |= ADC_MCR_NRSMPL(0x03u) | ADC_MCR_AVGEN(1U);
                        AdcBasePtr->MCR = Mcr;

                        /* Start calibration */
                        AdcBasePtr->MCR |= ADC_MCR_CALSTART(1U);
                        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();
                    }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                    Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
                }
                else
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)*/
                {
                    /* Wait for calibration to finish */
                    CalStatus = Adc_Sar_CheckFlagWithTimeout(MSRAddr, ADC_MSR_CALBUSY_MASK, 0U);
                    if ((ADC_SAR_IP_STATUS_SUCCESS == CalStatus))
                    {
                        uint32 MsrAddrTemp = *MSRAddr;
                        if ((MsrAddrTemp & ADC_MSR_CALFAIL_MASK) != 0U)
                        {
                            /* If the calibration failed, return error */
                            CalStatus = ADC_SAR_IP_STATUS_ERROR;
                        }
                        else
                        {
                            ; /* Empty else branch to avoid MISRA */
                        }
                    }
                    else
                    {
                        ; /* Empty else branch to avoid MISRA */
                    }
                    Status = Adc_Sar_CalibrationClkRestore(u32Instance, MCRAddr, McrSavedValue);
                }
#endif /* ADC_SAR_IP_CALIBRATION_USES_MCR */
            }
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                Status = CalStatus;
            }
    return Status;
}
#endif /* ADC_SAR_IP_CALIBRATION_AVAILABLE */
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Powerup
* Description   : This function enables the ADC module (by clearing the Powerdown
*  bit).
*
* @implements      Adc_Sar_Ip_Powerup_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerup(const uint32 u32Instance)
{
    Adc_Sar_Ip_StatusType ReturnStatus = ADC_SAR_IP_STATUS_SUCCESS;

    const ADC_Type * AdcBasePtr = NULL_PTR;
#if ADC_SAR_IP_HAS_BANDGAP_STATUS
    uint32 BandGapStatus = 0u;
#else
    uint32 ExpectedStatus = ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE);  /* expected status is IDLE */
    uint32 MsrStatus;
    volatile const uint32 * MSRAddr = NULL_PTR;
#endif /* ADC_SAR_IP_HAS_BANDGAP_STATUS */
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
#if !ADC_SAR_IP_HAS_BANDGAP_STATUS
        MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#endif /* !ADC_SAR_IP_HAS_BANDGAP_STATUS */
    }

