zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
#if ADC_SAR_IP_HAS_ADCLKSEL
        /* Read MCR value and clear values that will be replaced */
        Mcr |= Adc_Sar_GetADCLKSELValue(pConfig->ClkSelect);
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
        Status = Adc_Sar_Ip_Powerdown(u32Instance);
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
#if ADC_SAR_IP_HAS_ADCLKSEL
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_15();
            *MCRAddr = ((*MCRAddr) & ~(ADC_MCR_ADCLKSEL_MASK)) | Mcr;
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_15();
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

            Status = Adc_Sar_Ip_Powerup(u32Instance);
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {

#if ADC_SAR_IP_AVERAGING_AVAILABLE
                Adc_Sar_Ip_SetAveraging(u32Instance, pConfig->AvgEn, pConfig->AvgSel);
#endif /* ADC_SAR_IP_AVERAGING_AVAILABLE */
                /* Set powerdown delay */
                *PDEDRAddr = ADC_PDEDR_PDED(pConfig->PowerDownDelay);

#if ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE
                /* Set sample times */
                Adc_Sar_Ip_SetSampleTimes(u32Instance, pConfig->SampleTimeArr);
#endif /* ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE */
            }
        }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    }
    else
    {
        Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
    }
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}

#if ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetSampleTimes
* Description   : This function sets the sample times for each channnel group.
*
* @implements      Adc_Sar_Ip_SetSampleTimes_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetSampleTimes(const uint32 u32Instance,
                               const uint8 * const aSampleTimes)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint8 Index;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        for (Index = 0u; Index < Adc_Sar_Ip_au8AdcGroupCount[u32Instance]; Index++)
        {
            /* Set sample times */
            CTR(AdcBasePtr, Index) = ADC_CTR_INPSAMP(aSampleTimes[Index]);
        }
    }
}
#endif /* ADC_SAR_IP_CONVERSION_TIMING_AVAILABLE */

#if ADC_SAR_IP_AVERAGING_AVAILABLE
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetAveraging
* Description   : This function sets the sample times for each channnel group.
*
* @implements      Adc_Sar_Ip_SetAveraging_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetAveraging(const uint32 u32Instance,
                             const boolean bAvgEn,
                             const Adc_Sar_Ip_AvgSelectType eAvgSel)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * MCRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
    }

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_16();
    /* Clear old values */
    *MCRAddr &= ~(ADC_MCR_AVGEN_MASK | ADC_MCR_AVGS_MASK);

    /* Write new values */
    *MCRAddr |= ADC_MCR_AVGEN(bAvgEn ? 1U : 0U) | ADC_MCR_AVGS(eAvgSel);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_16();
}
#endif /* ADC_SAR_IP_AVERAGING_AVAILABLE */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_AbortConversion
* Description   : This function aborts an ongoing conversion.
*
* @implements      Adc_Sar_Ip_AbortConversion_Activity
* END**************************************************************************/
void Adc_Sar_Ip_AbortConversion(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if (FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    {
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_17();
            AdcBasePtr->MCR |= ADC_MCR_ABORT(1U);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_17();
        }

    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_AbortChain
* Description   : This function aborts an ongoing chain of conversions.
*
* @implements      Adc_Sar_Ip_AbortChain_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_AbortChain(const uint32 u32Instance,
                                            const boolean bBlocking,
                                            const boolean bAllowRestart)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * MCRAddr = NULL_PTR;
    volatile const uint32 * MSRAddr = NULL_PTR;
    uint32 MsrStatus;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;
    Adc_Sar_Ip_StatusType ReturnStatus = ADC_SAR_IP_STATUS_SUCCESS;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if (FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
    {
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
            MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
        }

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_18();
        /* The behavior of the ADC depends on MCR[MODE] (One-Shot/Scan Operation modes).
        If Scan Operation mode is disabled, MSR[NSTART] is automatically reset together with MCR[ABORTCHAIN].
        Otherwise, in Scan Operation mode, a new chain is started. Therefore MCR[NSTART] should be cleared
        before abort the current chain of conversions. */
        if (!bAllowRestart)
        {
            *MCRAddr &= ~(ADC_MCR_NSTART(1U));
#if ADC_SAR_IP_ABORTCHAIN_WORKAROUND
            /* Workaround to fix abort chain cannot clear MSR[NSTART] bit in scan mode */
            while (ElapsedTicks < TimeoutTicks)
            {
                ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
            }
#endif /* ADC_SAR_IP_ABORTCHAIN_WORKAROUND */
        }
        *MCRAddr |= ADC_MCR_ABORTCHAIN(1U);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_18();

