zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/Adc/src/Adc_Sar_Ip.c
        if (bBlocking)
        {
#if ADC_SAR_IP_ABORTCHAIN_WORKAROUND
            CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
            ElapsedTicks = 0u;
#endif /* ADC_SAR_IP_ABORTCHAIN_WORKAROUND */
            /* Wait for the ongoing conversion to stop */
            MsrStatus = *MSRAddr & ADC_MSR_NSTART_MASK;
            while ((MsrStatus == ADC_MSR_NSTART_MASK) && (ElapsedTicks < TimeoutTicks))
            {
                MsrStatus = *MSRAddr & ADC_MSR_NSTART_MASK;
                ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
            }
            if (ElapsedTicks >= TimeoutTicks)
            {
                ReturnStatus = ADC_SAR_IP_STATUS_TIMEOUT;
            }
#if !ADC_SAR_IP_W1C_ABORT
            else
            {
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_18();
                /* Clear the ABORT_CHAIN bit if set, otherwise the next chain will be ABORTED without any End of Chain Interrupt */
                if (((*MCRAddr) & ADC_MCR_ABORTCHAIN_MASK) != 0u)
                {
                    *MCRAddr &= ~(ADC_MCR_ABORTCHAIN(1U));
                }
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_18();
            }
#endif /* ADC_SAR_IP_W1C_ABORT */
        }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    }
    else
    {
        ReturnStatus = ADC_SAR_IP_STATUS_CAL_ONGOING;
    }
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return ReturnStatus;
}

#if ADC_SAR_IP_PRESAMPLING_AVAILABLE
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetPresamplingSource
* Description   : This function configures the Presampling Source for a channel group (0-31, 32-63, 64 -95)
*
* @implements      Adc_Sar_Ip_SetPresamplingSource_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetPresamplingSource(const uint32 u32Instance,
                                     const Adc_Sar_Ip_ChanGroupType pChanGroup,
                                     const Adc_Sar_Ip_PresamplingSourceType pPresampleSource)
{
    uint32 Pscr;
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * PSCRAddr = NULL_PTR;

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        PSCRAddr = (volatile uint32 *)&(AdcBasePtr->PSCR);
    }

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_PSCR(u32Instance))
    {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_38();

        Pscr = *PSCRAddr;

        switch (pChanGroup)
        {
#ifdef ADC_PSCR_PREVAL0
            case ADC_SAR_IP_CHAN_GROUP_0:
                Pscr &= ~(ADC_PSCR_PREVAL0_MASK);
                Pscr |= ADC_PSCR_PREVAL0((uint32)pPresampleSource);
                break;
#endif /* ADC_PSCR_PREVAL0 */
#ifdef ADC_PSCR_PREVAL1
            case ADC_SAR_IP_CHAN_GROUP_1:
                Pscr &= ~(ADC_PSCR_PREVAL1_MASK);
                Pscr |= ADC_PSCR_PREVAL1((uint32)pPresampleSource);
                break;
#endif /* ADC_PSCR_PREVAL1 */
#ifdef ADC_PSCR_PREVAL2
            case ADC_SAR_IP_CHAN_GROUP_2:
                Pscr &= ~(ADC_PSCR_PREVAL2_MASK);
                Pscr |= ADC_PSCR_PREVAL2((uint32)pPresampleSource);
                break;
#endif /* ADC_PSCR_PREVAL2 */
            default:
                ; /* no-op */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
                /* Not supported */
                DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
                break;
        }

        *PSCRAddr = Pscr;

        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_38();
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_EnableChannelPresampling
* Description   : This function enables the Presampling on one channel of the ADC.
*
* @implements      Adc_Sar_Ip_EnableChannelPresampling_Activity
* END**************************************************************************/
void Adc_Sar_Ip_EnableChannelPresampling(const uint32 u32Instance,
                                         const uint32 u32ChnIdx)
{
    uint32 VectAdr;
    uint32 VectBit;
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)(ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx)));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_PSCR(u32Instance))
    {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
        VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
        VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_41();
            PSR(AdcBasePtr, VectAdr) |= 1UL << VectBit;
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_41();
        }
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisableChannelPresampling
* Description   : This function disables the Presampling on one channel of the ADC.
*
* @implements      Adc_Sar_Ip_DisableChannelPresampling_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisableChannelPresampling(const uint32 u32Instance,
                                          const uint32 u32ChnIdx)
{
    uint32 VectAdr;
    uint32 VectBit;
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)(ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx)));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_PSCR(u32Instance))
    {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
        VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
        VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_42();
            PSR(AdcBasePtr, VectAdr) &= ~(1UL << VectBit);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_42();
        }
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_EnablePresampleConversion
* Description   : This function enables bypass of the Sampling Phase, resulting in a conversion
* of the presampled data. This is available only for channels that have presampling
* enabled.
*
* @implements      Adc_Sar_Ip_EnablePresampleConversion_Activity
* END**************************************************************************/
void Adc_Sar_Ip_EnablePresampleConversion(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_PSCR(u32Instance))
    {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */

        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_39();
            AdcBasePtr->PSCR |= ADC_PSCR_PRECONV(1U);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_39();
        }
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisablePresampleConversion
* Description   : This function disables Sampling Phase bypass.
*
* @implements      Adc_Sar_Ip_DisablePresampleConversion_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisablePresampleConversion(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_PSCR(u32Instance))
    {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */

        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_40();
            AdcBasePtr->PSCR &= ~(ADC_PSCR_PRECONV(1U));
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_40();
        }

#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
}
#endif /* ADC_SAR_IP_PRESAMPLING_AVAILABLE */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_EnableDma
* Description   : This function enables requests to DMA from ADC
*
* @implements      Adc_Sar_Ip_EnableDma_Activity
* END**************************************************************************/
void Adc_Sar_Ip_EnableDma(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_43();
        AdcBasePtr->DMAE |= ADC_DMAE_DMAEN(1U);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_43();
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisableDma
* Description   : This function disables requests to DMA from ADC
*
* @implements      Adc_Sar_Ip_DisableDma_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisableDma(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_44();
        AdcBasePtr->DMAE &= ~(ADC_DMAE_DMAEN(1U));
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_44();
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_EnableChannelDma
* Description   : This function enables DMA requests triggered by End of Conversion event from
*  a selected channel.
*
* @implements      Adc_Sar_Ip_EnableChannelDma_Activity
* END**************************************************************************/
void Adc_Sar_Ip_EnableChannelDma(const uint32 u32Instance,
                                 const uint32 u32ChnIdx)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint32 VectAdr;
    uint32 VectBit;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_46();
        DMAR(AdcBasePtr, VectAdr) |= 1UL << VectBit;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_46();
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisableChannelDma
* Description   : This function disables DMA requests triggered by End of Conversion event from
*  a selected channel.
*
* @implements      Adc_Sar_Ip_DisableChannelDma_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisableChannelDma(const uint32 u32Instance,
                                  const uint32 u32ChnIdx)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint32 VectAdr;
    uint32 VectBit;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(u32ChnIdx < ADC_SAR_IP_CDR_COUNT));
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert((boolean)ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_47();
        DMAR(AdcBasePtr, VectAdr) &= ~(1UL << VectBit);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_47();
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DisableChannelDmaAll
* Description   : This function disables DMA requests triggered by End of Conversion event from
*  all channels.
*
* @implements      Adc_Sar_Ip_DisableChannelDmaAll_Activity
* END**************************************************************************/
void Adc_Sar_Ip_DisableChannelDmaAll(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    uint8 Index;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        for (Index = 0U; Index < Adc_Sar_Ip_au8AdcGroupCount[u32Instance]; Index++)
        {
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_48();
            DMAR(AdcBasePtr, Index) &= ~(Adc_Sar_Ip_au32AdcChanBitmap[u32Instance][Index]);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_48();
        }
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetDmaClearSource
* Description   : This function selects the DMA Request Flag Clear Source.
*
* @implements      Adc_Sar_Ip_SetDmaClearSource_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetDmaClearSource(const uint32 u32Instance,
                                  const Adc_Sar_Ip_ClearSourceType pDmaClear)
{
    ADC_Type * AdcBasePtr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_45();
        AdcBasePtr->DMAE &= ~(ADC_DMAE_DCLR_MASK);
        AdcBasePtr->DMAE |= ADC_DMAE_DCLR((uint32)pDmaClear);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_45();
    }
}

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetWdgThreshold
* Description   : This function sets the watchdog thresholds for a certain register.
*
* @implements      Adc_Sar_Ip_SetWdgThreshold_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetWdgThreshold(const uint32 u32Instance,
                                const uint8 u8RegisterIdx,
                                const Adc_Sar_Ip_WdgThresholdType * const pThresholdValues)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
    volatile uint32 * WTIMRAddr = NULL_PTR;
    uint32 Wtimr;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((boolean)(u32Instance < ADC_SAR_IP_INSTANCE_COUNT));
    DevAssert((boolean)(pThresholdValues != NULL_PTR));
    DevAssert((boolean)(u8RegisterIdx < ADC_SAR_IP_THRHLR_COUNT));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        WTIMRAddr = (volatile uint32 *)&(AdcBasePtr->WTIMR);
    }
    {
        Adc_Sar_WriteThresholds(u32Instance, u8RegisterIdx, pThresholdValues->HighThreshold, pThresholdValues->LowThreshold);
    }

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_32();

    Wtimr = *WTIMRAddr;

    if (pThresholdValues->HighThresholdIntEn)
    {
        Wtimr |= (ADC_SAR_IP_WDG_REG_MASK_HIGH(u8RegisterIdx));
    }
    else
    {
        Wtimr &= (~ADC_SAR_IP_WDG_REG_MASK_HIGH(u8RegisterIdx));
    }
    if (pThresholdValues->LowThresholdIntEn)
    {
        Wtimr |= (ADC_SAR_IP_WDG_REG_MASK_LOW(u8RegisterIdx));
    }
    else
    {
        Wtimr &= (~ADC_SAR_IP_WDG_REG_MASK_LOW(u8RegisterIdx));
    }

    *WTIMRAddr = Wtimr;

